In [1]:
import pandas as pd

In [2]:
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}
c = ['name', 'subject', 'score', 'grade', 'etc']

df = pd.DataFrame(data=score, columns=c)
print(df)

    name subject  score grade  etc
0  Jessi  python    100     A  NaN
1   Emma    java     95     A  NaN
2   Alex  python     80     B  NaN
3  Jessi       c     85     B  NaN
4    Tom    java     97     A  NaN

In [3]:
df['high_score']=df['score']>90

print('\nAdd Columns : high_score')
print(df)

Add Columns : high_score
    name subject  score grade  etc  high_score
0  Jessi  python    100     A  NaN        True
1   Emma    java     95     A  NaN        True
2   Alex  python     80     B  NaN       False
3  Jessi       c     85     B  NaN       False
4    Tom    java     97     A  NaN        True

In [9]:
df.loc[6] = ['Jina', 'python', 100, 'A', 1, True]

print('\nAdd Row 6')
print(df)

Add Row 6
    name subject  score grade  etc  high_score
0  Jessi  python    100     A  NaN        True
1   Emma    java     95     A  NaN        True
2   Alex  python     80     B  NaN       False
3  Jessi       c     85     B  NaN       False
4    Tom    java     97     A  NaN        True
6   Jina  python    100     A    1        True

In [10]:
'''
1) drop() 이용하여 행 데이터 삭제
2) inplace 인자를 사용하여 원본 데이터에 바로 삭제
'''
df.drop(6,inplace=True)

print('\nDelete Row : 6')
print(df)

Delete Row : 6
    name subject  score grade  etc  high_score
0  Jessi  python    100     A  NaN        True
1   Emma    java     95     A  NaN        True
2   Alex  python     80     B  NaN       False
3  Jessi       c     85     B  NaN       False
4    Tom    java     97     A  NaN        True

In [11]:
'''
drop() 이용하여 'etc' 열 삭제 (원본데이터변경)
'''
df.drop(columns='etc',inplace=True)

print('\nDelete Column :')
print(df)

Delete Column :
    name subject  score grade  high_score
0  Jessi  python    100     A        True
1   Emma    java     95     A        True
2   Alex  python     80     B       False
3  Jessi       c     85     B       False
4    Tom    java     97     A        True